// RGB7170 - Давхрын хэд дэх хаалга
// Нэг орцтой байрны давхрын тоо, давхар дахь хаалганы тоо өгөгдөв. Айлын хаалганы дугаар мэдэгдэж байгаа үед тэрхүү айл хэд дэх давхрын хэд дэх хаалганд амьдардаг вэ? Давталт ашиглахгүй бодно.

// Input
//  Эхний мөрөнд давхрын тоо, давхар дахь хаалганы тоо зайгаар тусгаарлагдан өгөгдөнө.

// Хоёр дахь мөрөнд айлын хаалганы тоо өгөгдөнө.

// Output
// Давхрын тоо, давхар дахь хэд дэх хаалганы тоо зайгаар тусгаарлагдан хэвлэгдэнэ.

// Example
// Input:
// 5 4
// 10

// Output:
// 3 2
function num(a, b, c) {
  let = x;
  if ((c % b) + 1 && c / a) {
  }
  console.log();
}
num(5, 4, 10);
